===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
1
===================================================
a    b    c    d    e    f    
1     a     aa             100     2012-12-12 00:00:00.0     12:12:12     
2     b     b              200     1999-12-12 00:00:00.0     1999-12-12     
3     c     cc             300     2000-10-01 10:10:10.0     2000-10-01 10:10:10     
4     d     d              400     1998-05-06 13:20:21.0     1998-05-06 13:20:21.123     

===================================================
cast(b as char(20))    
a                        
b                        
c                        
d                        

===================================================
cast(b as varchar)    
a     
b     
c     
d     

===================================================
Error:-181
===================================================
Error:-181
===================================================
cast(b as varchar)    
a     
b     
c     
d     

===================================================
cast(d as char(20))    
100                      
200                      
300                      
400                      

===================================================
cast(d as varchar)    
100     
200     
300     
400     

===================================================
Error:-181
===================================================
Error:-181
===================================================
cast(d as varchar)    
100     
200     
300     
400     

===================================================
cast(f as char(23))    
12:12:12                    
1998-05-06 13:20:21.123     
1999-12-12                  
2000-10-01 10:10:10         

===================================================
cast(f as varchar)    
12:12:12     
1998-05-06 13:20:21.123     
1999-12-12     
2000-10-01 10:10:10     

===================================================
Error:-181
===================================================
Error:-181
===================================================
cast(f as varchar)    
12:12:12     
1998-05-06 13:20:21.123     
1999-12-12     
2000-10-01 10:10:10     

===================================================
0
